/**
 * 文件说明：中文语言包，维护前端页面默认展示文案。
 */
// 认证相关
export default {
  // 认证 - 登录
  登录你的账户: '登录你的账户',
  在下方输入你的邮箱和密码以登录: '在下方输入你的邮箱和密码以登录',
  登录: '登录',
  '忘记密码？': '忘记密码？',
  记住我: '记住我',
  '没有账户？': '没有账户？',
  注册: '注册',

  // 认证 - 注册
  创建账户: '创建账户',
  在下方输入你的详细信息以创建账户: '在下方输入你的详细信息以创建账户',
  '已有账户？': '已有账户？',

  // 认证 - 重置密码
  重置密码: '重置密码',
  请在下方输入你的新密码: '请在下方输入你的新密码',
  电子邮件: '电子邮件',

  // 认证 - 两步验证挑战
  身份验证码: '身份验证码',
  '输入你的身份验证器应用程序提供的验证码。':
    '输入你的身份验证器应用程序提供的验证码。',
  使用恢复码登录: '使用恢复码登录',
  恢复码: '恢复码',
  '请输入你的紧急恢复码之一来确认访问你的账户。':
    '请输入你的紧急恢复码之一来确认访问你的账户。',
  使用身份验证码登录: '使用身份验证码登录',
  或者你可以: '或者你可以',

  // 认证 - 确认密码
  确认你的密码: '确认你的密码',
  '这是应用程序的安全区域。请在继续之前确认你的密码。':
    '这是应用程序的安全区域。请在继续之前确认你的密码。',
  确认密码页面: '确认密码页面',

  // 认证 - 忘记密码
  忘记密码: '忘记密码',
  输入你的电子邮件以接收密码重置链接: '输入你的电子邮件以接收密码重置链接',
  发送密码重置链接: '发送密码重置链接',
  '或者，返回': '或者，返回',

  // 认证 - 验证邮箱
  验证电子邮件: '验证电子邮件',
  '请点击我们刚刚发送给你的电子邮件中的链接来验证你的电子邮件地址。':
    '请点击我们刚刚发送给你的电子邮件中的链接来验证你的电子邮件地址。',
  邮箱验证: '邮箱验证',
  '新的验证链接已发送到你注册时提供的电子邮件地址。':
    '新的验证链接已发送到你注册时提供的电子邮件地址。',
  重新发送验证邮件: '重新发送验证邮件',
  退出登录: '退出登录',
} as const;
